wrk_rps_merged/588
Running 5m test @ http://10.110.19.161:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 157.462ms, rate sampling interval: 862ms
  Thread calibration: mean lat.: 196.436ms, rate sampling interval: 1060ms
  Thread calibration: mean lat.: 191.047ms, rate sampling interval: 1019ms
  Thread calibration: mean lat.: 205.336ms, rate sampling interval: 1230ms
  Thread calibration: mean lat.: 200.651ms, rate sampling interval: 1022ms
  Thread calibration: mean lat.: 195.292ms, rate sampling interval: 1011ms
  Thread calibration: mean lat.: 204.537ms, rate sampling interval: 1218ms
  Thread calibration: mean lat.: 203.964ms, rate sampling interval: 1204ms
  Thread calibration: mean lat.: 209.749ms, rate sampling interval: 1226ms
  Thread calibration: mean lat.: 202.059ms, rate sampling interval: 1227ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   412.29ms  308.25ms   3.11s    80.82%
    Req/Sec     9.39      2.77    20.00     86.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  390.14ms
 75.000%  506.37ms
 90.000%  690.69ms
 99.000%    1.63s 
 99.900%    2.01s 
 99.990%    2.84s 
 99.999%    3.11s 
100.000%    3.11s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.503     0.000000            1         1.00
      81.087     0.100000         2901         1.11
     210.175     0.200000         5808         1.25
     283.903     0.300000         8708         1.43
     315.903     0.400000        11597         1.67
     390.143     0.500000        14511         2.00
     401.151     0.550000        15970         2.22
     412.927     0.600000        17401         2.50
     478.463     0.650000        18845         2.86
     490.751     0.700000        20313         3.33
     506.367     0.750000        21747         4.00
     521.983     0.775000        22470         4.44
     581.119     0.800000        23201         5.00
     590.335     0.825000        23930         5.71
     601.599     0.850000        24646         6.67
     633.855     0.875000        25369         8.00
     681.983     0.887500        25758         8.89
     690.687     0.900000        26101        10.00
     705.023     0.912500        26461        11.43
     736.255     0.925000        26818        13.33
     806.399     0.937500        27180        16.00
     824.831     0.943750        27362        17.78
     898.559     0.950000        27546        20.00
    1005.567     0.956250        27724        22.86
    1219.583     0.962500        27906        26.67
    1314.815     0.968750        28090        32.00
    1385.471     0.971875        28177        35.56
    1412.095     0.975000        28274        40.00
    1485.823     0.978125        28360        45.71
    1511.423     0.981250        28453        53.33
    1579.007     0.984375        28539        64.00
    1590.271     0.985938        28588        71.11
    1599.487     0.987500        28633        80.00
    1614.847     0.989062        28677        91.43
    1638.399     0.990625        28723       106.67
    1689.599     0.992188        28770       128.00
    1696.767     0.992969        28791       142.22
    1713.151     0.993750        28811       160.00
    1726.463     0.994531        28835       182.86
    1790.975     0.995313        28857       213.33
    1807.359     0.996094        28879       256.00
    1816.575     0.996484        28891       284.44
    1823.743     0.996875        28902       320.00
    1891.327     0.997266        28913       365.71
    1898.495     0.997656        28926       426.67
    1906.687     0.998047        28936       512.00
    1918.975     0.998242        28942       568.89
    1929.215     0.998437        28948       640.00
    1943.551     0.998633        28954       731.43
    1992.703     0.998828        28959       853.33
    2011.135     0.999023        28964      1024.00
    2023.423     0.999121        28968      1137.78
    2026.495     0.999219        28971      1280.00
    2030.591     0.999316        28973      1462.86
    2123.775     0.999414        28976      1706.67
    2224.127     0.999512        28978      2048.00
    2402.303     0.999561        28980      2275.56
    2426.879     0.999609        28981      2560.00
    2523.135     0.999658        28984      2925.71
    2523.135     0.999707        28984      3413.33
    2525.183     0.999756        28985      4096.00
    2699.263     0.999780        28986      4551.11
    2805.759     0.999805        28987      5120.00
    2820.095     0.999829        28988      5851.43
    2820.095     0.999854        28988      6826.67
    2836.479     0.999878        28989      8192.00
    2836.479     0.999890        28989      9102.22
    2885.631     0.999902        28990     10240.00
    2885.631     0.999915        28990     11702.86
    2885.631     0.999927        28990     13653.33
    3098.623     0.999939        28991     16384.00
    3098.623     0.999945        28991     18204.44
    3098.623     0.999951        28991     20480.00
    3098.623     0.999957        28991     23405.71
    3098.623     0.999963        28991     27306.67
    3108.863     0.999969        28992     32768.00
    3108.863     1.000000        28992          inf
#[Mean    =      412.292, StdDeviation   =      308.248]
#[Max     =     3106.816, Total count    =        28992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30022 requests in 5.00m, 167.24MB read
  Socket errors: connect 0, read 0, write 0, timeout 4
  Non-2xx or 3xx responses: 521
Requests/sec:    100.05
Transfer/sec:    570.69KB