wrk_rps_merged/70
Running 5m test @ http://10.105.9.112:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 147.728ms, rate sampling interval: 779ms
  Thread calibration: mean lat.: 150.360ms, rate sampling interval: 813ms
  Thread calibration: mean lat.: 155.609ms, rate sampling interval: 838ms
  Thread calibration: mean lat.: 152.803ms, rate sampling interval: 778ms
  Thread calibration: mean lat.: 165.343ms, rate sampling interval: 839ms
  Thread calibration: mean lat.: 169.693ms, rate sampling interval: 860ms
  Thread calibration: mean lat.: 170.601ms, rate sampling interval: 833ms
  Thread calibration: mean lat.: 162.734ms, rate sampling interval: 822ms
  Thread calibration: mean lat.: 170.873ms, rate sampling interval: 868ms
  Thread calibration: mean lat.: 168.415ms, rate sampling interval: 893ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   270.63ms  287.77ms   1.95s    89.83%
    Req/Sec     9.53      3.42    26.00     76.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  207.49ms
 75.000%  343.81ms
 90.000%  569.34ms
 99.000%    1.50s 
 99.900%    1.80s 
 99.990%    1.95s 
 99.999%    1.95s 
100.000%    1.95s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.569     0.000000            1         1.00
      24.351     0.100000         2912         1.11
      50.783     0.200000         5825         1.25
      89.215     0.300000         8735         1.43
     146.175     0.400000        11659         1.67
     207.487     0.500000        14564         2.00
     227.327     0.550000        16025         2.22
     248.191     0.600000        17470         2.50
     300.287     0.650000        18930         2.86
     313.855     0.700000        20403         3.33
     343.807     0.750000        21840         4.00
     395.519     0.775000        22585         4.44
     404.991     0.800000        23303         5.00
     415.231     0.825000        24023         5.71
     452.351     0.850000        24749         6.67
     506.367     0.875000        25479         8.00
     524.287     0.887500        25841         8.89
     569.343     0.900000        26204        10.00
     610.303     0.912500        26581        11.43
     680.447     0.925000        26932        13.33
     749.055     0.937500        27298        16.00
     806.911     0.943750        27482        17.78
     843.263     0.950000        27660        20.00
     903.679     0.956250        27843        22.86
     944.639     0.962500        28027        26.67
    1062.911     0.968750        28206        32.00
    1133.567     0.971875        28297        35.56
    1208.319     0.975000        28388        40.00
    1267.711     0.978125        28479        45.71
    1315.839     0.981250        28572        53.33
    1382.399     0.984375        28661        64.00
    1406.975     0.985938        28707        71.11
    1426.431     0.987500        28752        80.00
    1454.079     0.989062        28797        91.43
    1505.279     0.990625        28843       106.67
    1542.143     0.992188        28889       128.00
    1557.503     0.992969        28912       142.22
    1600.511     0.993750        28935       160.00
    1607.679     0.994531        28956       182.86
    1631.231     0.995313        28979       213.33
    1654.783     0.996094        29005       256.00
    1693.695     0.996484        29013       284.44
    1701.887     0.996875        29026       320.00
    1707.007     0.997266        29036       365.71
    1725.439     0.997656        29048       426.67
    1736.703     0.998047        29059       512.00
    1741.823     0.998242        29064       568.89
    1758.207     0.998437        29070       640.00
    1793.023     0.998633        29076       731.43
    1797.119     0.998828        29081       853.33
    1804.287     0.999023        29089      1024.00
    1805.311     0.999121        29091      1137.78
    1808.383     0.999219        29093      1280.00
    1826.815     0.999316        29096      1462.86
    1830.911     0.999414        29098      1706.67
    1838.079     0.999512        29101      2048.00
    1861.631     0.999561        29103      2275.56
    1863.679     0.999609        29106      2560.00
    1863.679     0.999658        29106      2925.71
    1935.359     0.999707        29107      3413.33
    1941.503     0.999756        29108      4096.00
    1942.527     0.999780        29109      4551.11
    1944.575     0.999805        29110      5120.00
    1947.647     0.999829        29112      5851.43
    1947.647     0.999854        29112      6826.67
    1947.647     0.999878        29112      8192.00
    1947.647     0.999890        29112      9102.22
    1949.695     0.999902        29114     10240.00
    1949.695     0.999915        29114     11702.86
    1949.695     0.999927        29114     13653.33
    1949.695     0.999939        29114     16384.00
    1949.695     0.999945        29114     18204.44
    1949.695     0.999951        29114     20480.00
    1949.695     0.999957        29114     23405.71
    1949.695     0.999963        29114     27306.67
    1951.743     0.999969        29115     32768.00
    1951.743     1.000000        29115          inf
#[Mean    =      270.634, StdDeviation   =      287.770]
#[Max     =     1950.720, Total count    =        29115]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30050 requests in 5.00m, 146.14MB read
  Non-2xx or 3xx responses: 329
Requests/sec:    100.15
Transfer/sec:    498.74KB